pages/3-3-3-units_info.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>3.3.3 Units of Information</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">3.3.3 Units of Information</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Base Number and Units</a>
<ul>
<li><a href="#sec-1-1">Learn It</a></li>
<li><a href="#sec-1-2">Learn It</a>
<ul>
<li><a href="#sec-1-2-1">Units</a></li>
</ul>
</li>
<li><a href="#sec-1-3">Badge It</a></li>
<li><a href="#sec-1-4">Badge It</a></li>
<li><a href="#sec-1-5">Badge It</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class=ribbon>
<a href="GITHUB URL HERE">Fork me on GitHub</a>
</div>
<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1"><span class="section-number-2">1</span> Base Number and Units</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3 learn">
<h3 id="sec-1-1">Learn It</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<b>Binary Bits</b>
</p>
<ul class="org-ul">
<li>Computers are made up of electronic hardware that can store and
process data.
</li>
<li>A computer can be broken down into basic components which contain
millions of IC circuits that either do or do not allow electicity to
flow through them.
</li>
<li>IC circuits are like rows of switches that can either be on or off,
different combinations can mean different things.
</li>
<li>Each switch can be represented by 1 or 0. This is called <b>binary</b>.
</li>
<li>A single <b>1</b> or <b>0</b> is a <b>Binary</b> <b>digIT</b>, or a <b>BIT</b> for short.
</li>
<li>A <b>byte</b> is a group of eight bits.
</li>
<li>A <b>nibble</b> is a group of 4 bits or half a byte.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3 learn">
<h3 id="sec-1-2">Learn It</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1">Units</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>A byte is the smallest addressable unit of memory in a
computer. Just like a kilometer is a 1000 meters, we can group
together a 1000 bytes to make a <b>kilobyte</b>.
</li>
<li>Memory size is measured in the following multiples:
</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><b>Unit</b></th>
<th scope="col" class="left"><b>Number of bytes</b></th>
<th scope="col" class="left"><b>Decimal value</b></th>
<th scope="col" class="left"><b>Equivalent to</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Kilobyte(KB)</td>
<td class="left">10<sup>3</sup></td>
<td class="left">1,000</td>
<td class="left">1024 bytes</td>
</tr>

<tr>
<td class="left">Megabyte(MB)</td>
<td class="left">10<sup>6</sup></td>
<td class="left">1,000,000</td>
<td class="left">1024 kilobytes</td>
</tr>

<tr>
<td class="left">Gigabyte(GB)</td>
<td class="left">10<sup>9</sup></td>
<td class="left">1,000,000,000</td>
<td class="left">1024 megabytes</td>
</tr>

<tr>
<td class="left">Terabyte(TB)</td>
<td class="left">10<sup>12</sup></td>
<td class="left">1,000,000,000,000</td>
<td class="left">1024 gigabytes</td>
</tr>

<tr>
<td class="left">Petabyte(PB</td>
<td class="left">10<sup>15</sup></td>
<td class="left">1,000,000,000,000,000</td>
<td class="left">1024 terabytes</td>
</tr>

<tr>
<td class="left">Exabyte(XB)</td>
<td class="left">10<sup>18</sup></td>
<td class="left">1,000,000,000,000,000,000</td>
<td class="left">1024 petabytes</td>
</tr>

<tr>
<td class="left">Zettabyte(ZB)</td>
<td class="left">10<sup>21</sup></td>
<td class="left">1,000,000,000,000,000,000,000</td>
<td class="left">1024 exabytes</td>
</tr>

<tr>
<td class="left">Yotabyte(YB)</td>
<td class="left">10<sup>24</sup></td>
<td class="left">1,000,000,000,000,000,000,000,000</td>
<td class="left">1024 zettabytes</td>
</tr>
</tbody>
</table>
<p>
<b>Please Note</b>
</p>
<ul class="org-ul">
<li>1MB = 1000KB etc. Internal memory often use the Kibibyte, where
1KiB (Kibibyte) = 2<sup>10</sup> = 1,024 bytes, MiB (Mebibyte) = 2<sup>20</sup> =
1,048,576 bytes, and so on.
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3 badge">
<h3 id="sec-1-3">Badge It</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li><b>Silver</b>: Answer the following 3 questions and submit to <b>www.bournetolearn.com</b>
</li>
</ul>
<pre class="example">
1. How many bytes in a 1,000 Exabyte?
2. Convert 5600MB into GB.
3. Convert 1000TB into GB.
</pre>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3 badge">
<h3 id="sec-1-4">Badge It</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li><b>Gold</b>: Answer the following questions and submit to <b>www.bournetolearn.com</b>
</li>
</ul>
<pre class="example">
1. What is meant by a bit?
2. What is the highest value that can be represented by a nibble?
3. How many bits are there in a byte?
4. How many bytes do 12bits make?
5. How many megabytes are there in 3 gigabytes?
</pre>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3 badge">
<h3 id="sec-1-5">Badge It</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li><b>Platinum</b>: Complete the Python program below, which is a conversion
program where you can choose to convert from either KB, MB, GB, TB
or PB. The user can enter the number of kilobytes and then return the number of bytes for that unit.
</li>
</ul>
<iframe src="https://trinket.io/embed/python/8e25292036" width="100%" height="600" frameborder="0" marginwidth="0" marginheight="0" allowfullscreen></iframe>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>